Config/Reports/ЖурналУчетаДвиженияПутевыхЛистов0345008.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Report>
		<Properties>
			<Name>ЖурналУчетаДвиженияПутевыхЛистов0345008</Name>
			<Comment>Журнал учета движения путевых листов по ф.№ 8 (код ОКУД 0345008)</Comment>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонецПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоВсемОрганизациям</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВывестиТитульныеЛисты</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДобавлятьВГрафуГаражныйНомерГосНомер</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоВсемПодразделениям</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

Config/Reports/ЖурналУчетаДвиженияПутевыхЛистов0345008/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
////////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС

Процедура СформироватьОтчет(ЖурналУчета, ТитульныеЛисты) Экспорт
	СформироватьЖурналУчета(ЖурналУчета);
	СформироватьТитульныйЛист(ТитульныеЛисты);
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

 // Процедура формирует журнал учета в переданный табличный документ
 //
 // Параметры
 //  ЖурналУчета  - ТабличныйДокумент - табличный документ, в который
 //                 формируется журнал учета
 //
Процедура СформироватьЖурналУчета(ЖурналУчета)
	ЖурналУчета.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	ЖурналУчета.АвтоМасштаб = Истина;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НачалоПериода", НачалоДня(НачалоПериода));
	Запрос.УстановитьПараметр("ОкончаниеПериода", КонецДня(КонецПериода));
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Подразделение", Подразделение);
	
	Запрос.Текст= "ВЫБРАТЬ
	              |	ЖурналПутевыхЛистов.Номер КАК Номер,
	              |	ЖурналПутевыхЛистов.Дата КАК Дата,
	              |	ЖурналПутевыхЛистов.Серия КАК Серия,
	              |	ЖурналПутевыхЛистов.ТранспортноеСредство КАК ТранспортноеСредство,
	              |	ЖурналПутевыхЛистов.ГаражныйНомер КАК ГаражныйНомер,
	              |	ЖурналПутевыхЛистов.ГосударственныйНомернойЗнак КАК ГосударственныйНомернойЗнак,
	              |	ЖурналПутевыхЛистов.Водитель КАК Водитель,
	              |	ВЫРАЗИТЬ(ЖурналПутевыхЛистов.Водитель КАК Справочник.Сотрудники).Код КАК ТабельныйНомер,
	              |	ЖурналПутевыхЛистов.Ссылка КАК Ссылка
	              |ИЗ
	              |	ЖурналДокументов.ЖурналПутевыхЛистов КАК ЖурналПутевыхЛистов
	              |ГДЕ
	              |	ЖурналПутевыхЛистов.Дата МЕЖДУ &НачалоПериода И &ОкончаниеПериода
	              |	И ЖурналПутевыхЛистов.Проведен = ИСТИНА";
	Если Не ПоВсемОрганизациям Тогда				 
		Запрос.Текст=Запрос.Текст+"
		| И	ЖурналПутевыхЛистов.Организация = &Организация";
	КонецЕсли;
	
	Если Не ПоВсемПодразделениям Тогда				 
		Запрос.Текст=Запрос.Текст+"
		| И	ЖурналПутевыхЛистов.Подразделение = &Подразделение";
	КонецЕсли;
	
	Запрос.Текст=Запрос.Текст+"				 
	             |
	             |УПОРЯДОЧИТЬ ПО
	             |	Дата,
	             |	Номер,
	             |	Серия";

	ЗапросПутевыеЛисты = Запрос.Выполнить().Выбрать();

	ЖурналУчета.Очистить();
	
	МаксимальноеКоличествоСтрокНаСтранице = 26;
	
	КоличествоСтрокОтчета = ЗапросПутевыеЛисты.Количество();
	
	КоличествоСтрокНаСтранице = 0;
	
	Макет = ПолучитьМакет("Журнал");
	ПерваяСтрока = Истина;
	
	Пока ЗапросПутевыеЛисты.Следующий() Цикл
		ОблСтрока = Макет.ПолучитьОбласть("Строка");
		
		Если НЕ ПерваяСтрока Тогда
			Если КоличествоСтрокНаСтранице>(МаксимальноеКоличествоСтрокНаСтранице-1) Тогда
				//вывод шапки
				ЖурналУчета.ВывестиГоризонтальныйРазделительСтраниц();
				ОблШапка = Макет.ПолучитьОбласть("Шапка");
				Если ДобавлятьВГрафуГаражныйНомерГосНомер Тогда
					ОблШапка.Параметры.ШапкаДляГосНомера = ", гос.номерной знак";	
				КонецЕсли;	
				ЖурналУчета.Вывести(ОблШапка);
				
				КоличествоСтрокНаСтранице = 0;
			КонецЕсли;	
		Иначе
			ОблШапка = Макет.ПолучитьОбласть("Шапка");
			Если ДобавлятьВГрафуГаражныйНомерГосНомер Тогда
				ОблШапка.Параметры.ШапкаДляГосНомера = ", гос.номерной знак";	
			КонецЕсли;	
			ЖурналУчета.Вывести(ОблШапка);
			
			ПерваяСтрока = Ложь;
		КонецЕсли;
		
		ОблСтрока.Параметры.Заполнить(ЗапросПутевыеЛисты);
		ОблСтрока.Параметры.СерияНомер = СокрЛП(ЗапросПутевыеЛисты.Серия)+" "+РегистрыСведений.НастройкиПечатиПрефиксаНомера.ПолучитьНомерДляПечатиПоСсылкеИдентификаторуДокумента(ЗапросПутевыеЛисты.Ссылка, ЗапросПутевыеЛисты.Номер);
		Если ДобавлятьВГрафуГаражныйНомерГосНомер Тогда
			ОблСтрока.Параметры.ГаражныйНомер = СокрЛП(ЗапросПутевыеЛисты.ГаражныйНомер) + ?(ЗначениеЗаполнено(ЗапросПутевыеЛисты.ГаражныйНомер)И(ЗначениеЗаполнено(ЗапросПутевыеЛисты.ГосударственныйНомернойЗнак)),", ","")	+ СокрЛП(ЗапросПутевыеЛисты.ГосударственныйНомернойЗнак);
		КонецЕсли;
		
		ЖурналУчета.Вывести(ОблСтрока);
		
		КоличествоСтрокНаСтранице = КоличествоСтрокНаСтранице + 1;
	КонецЦикла;	
	
	ОблПодвал = Макет.ПолучитьОбласть("Подвал");
	ЖурналУчета.Вывести(ОблПодвал);
	
КонецПроцедуры

 // Процедура формирует титульный лист в переданный табличный документ
 //
 // Параметры
 //  ЖурналУчета  - ТабличныйДокумент - табличный документ, в который
 //                 формируется титульный лист
 //
Процедура СформироватьТитульныйЛист(ТитульныеЛисты)
	ТитульныеЛисты.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	ТитульныеЛисты.АвтоМасштаб = Истина;
	ТитульныеЛисты.Очистить();
	
	Макет = ПолучитьМакет("ТитульныйЛист");
	
	Обл = Макет.ПолучитьОбласть("ТитульныйЛистШапка");
	Если НЕ ПоВсемОрганизациям Тогда
		СведенияОбОрганизации = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Организация, "НаименованиеПолное, КодОКПО");
		Обл.Параметры.пОрганизация = СведенияОбОрганизации.НаименованиеПолное;
		Обл.Параметры.пКодОКПО     = СведенияОбОрганизации.КодОКПО;
	КонецЕсли;
	ТитульныеЛисты.Вывести(Обл);
	
	Если ЗначениеЗаполнено(Подразделение) Тогда
		Обл = Макет.ПолучитьОбласть("Подразделение");
		СведенияОПодразделении = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Подразделение, "НаименованиеПолное");
		Обл.Параметры.пПодразделение = СведенияОПодразделении.НаименованиеПолное;
	Иначе
		Обл = Макет.ПолучитьОбласть("БезПодразделения");
	Конецесли;	
	ТитульныеЛисты.Вывести(Обл);
	
	Обл = Макет.ПолучитьОбласть("ТитульныйЛист");
	Попытка
		Обл.Параметры.СтрокаПериода = "за "+ Нрег(ПредставлениеПериода(НачалоДня(НачалоПериода), КонецДня(КонецПериода), "ФП"));
	Исключение
	КонецПопытки;

	ТитульныеЛисты.Вывести(Обл);
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ 

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	Если Не ПоВсемОрганизациям И Не ЗначениеЗаполнено(Организация) Тогда
		Отказ=Истина;
		ТекстСообщения = НСтр("ru = 'Необходимо выбрать Организацию или
							|поставить флажок ""По всем организациям""'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,, "Отчет.Организация",, Отказ)
	КонецЕсли;
	Если НачалоПериода > КонецПериода 
		И Не КонецПериода = '00010101' Тогда
		ТекстСообщения = НСтр("ru = 'Неправильно задан период формирования отчета!
		                             |Дата начала больше даты окончания периода.'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,, "Отчет.НачалоПериода",, Отказ);
	КонецЕсли;
КонецПроцедуры

#КонецЕсли
